; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v10 ?v11)
             (pred_9 ?v4 ?v1)
             (pred_11 ?v10 ?v1)
             (pred_4 ?v3 ?v10 )
	     (pred_3 ?v10)
             (pred_10 ?v9)
             (pred_7 ?v4)
             (pred_8 ?v1)
             (pred_2 ?v10)
             (pred_6 ?v4)
             (pred_1 ?v10)
             (pred_5 ))



(:action op_5
:parameters (?v7 ?v8 ?v13 ?v2)
:precondition (and (pred_10 ?v7) (pred_10 ?v8) (pred_7 ?v13) (pred_8 ?v2)
          (pred_12 ?v7 ?v8) (pred_9 ?v13 ?v2)
                   (pred_11 ?v8 ?v2) (pred_3 ?v7) 
                   (pred_2 ?v8) (pred_6 ?v13))
:effect (and  (pred_1 ?v8) (not (pred_2 ?v8))))


(:action op_1
:parameters (?v7 ?v5)
:precondition (and (pred_10 ?v7) (pred_10 ?v5)
               (pred_3 ?v7) (pred_12 ?v7 ?v5) (pred_1 ?v5))
:effect (and (pred_3 ?v5) (not (pred_3 ?v7))))

(:action op_3
:parameters (?v7 ?v13)
:precondition (and (pred_10 ?v7) (pred_7 ?v13) 
                  (pred_3 ?v7) (pred_4 ?v13 ?v7) (pred_5 ))
:effect (and (pred_6 ?v13)
   (not (pred_4 ?v13 ?v7)) (not (pred_5 ))))


(:action op_2
:parameters (?v7 ?v12 ?v6)
:precondition (and (pred_10 ?v7) (pred_7 ?v12) (pred_7 ?v6)
                  (pred_3 ?v7) (pred_6 ?v6) (pred_4 ?v12 ?v7))
:effect (and (pred_6 ?v12) (pred_4 ?v6 ?v7)
        (not (pred_6 ?v6)) (not (pred_4 ?v12 ?v7))))

(:action op_4
:parameters (?v7 ?v13)
:precondition (and (pred_10 ?v7) (pred_7 ?v13) 
                  (pred_3 ?v7) (pred_6 ?v13))
:effect (and (pred_5 ) (pred_4 ?v13 ?v7) (not (pred_6 ?v13)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_19 obj_17 obj_12 obj_13 obj_06 obj_21 obj_04 obj_10 obj_11 obj_20 obj_03 obj_05 obj_01 obj_22 obj_15
    obj_08 obj_09 obj_18
    obj_14 obj_02 obj_16
    )

    (:init
       (pred_5)

       (pred_10 obj_07)
       (pred_10 obj_19)
       (pred_10 obj_17)
       (pred_10 obj_12)
       (pred_10 obj_13)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_04)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_22)
       (pred_10 obj_15)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_8 obj_18)
       (pred_7 obj_14)
       (pred_7 obj_02)
       (pred_7 obj_16)

       (pred_12 obj_07 obj_13)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_19 obj_06)
       (pred_12 obj_19 obj_17)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_17 obj_21)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_19)
       (pred_12 obj_12 obj_04)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_13 obj_10)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_06 obj_21)
       (pred_12 obj_06 obj_19)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_21 obj_04)
       (pred_12 obj_21 obj_17)
       (pred_12 obj_21 obj_06)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_04 obj_12)
       (pred_12 obj_04 obj_21)
       (pred_12 obj_10 obj_05)
       (pred_12 obj_10 obj_11)
       (pred_12 obj_10 obj_13)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_10)
       (pred_12 obj_01 obj_22)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_22 obj_15)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_22 obj_01)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_22)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_07)
       (pred_11  obj_06 obj_08)
       (pred_11  obj_12 obj_09)
       (pred_11  obj_07 obj_18)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_1 obj_21)
       (pred_1 obj_04)
       (pred_1 obj_10)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_03)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_22)
       (pred_1 obj_15)

       (pred_9  obj_14 obj_08)
       (pred_9  obj_02 obj_09)
       (pred_9  obj_16 obj_18)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_16 obj_17)
       (pred_3 obj_15)
    )

    (:goal (and
       (pred_4 obj_16 obj_07)
    ))
(:constraints
  (always (not (pred_3 obj_03)))
)
)

; plan
1. (op_1 obj_15 obj_22)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_22)
   goals met: 0 of 1
2. (op_1 obj_22 obj_20)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_20)
   goals met: 0 of 1
3. (op_1 obj_20 obj_21)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_21)
   goals met: 0 of 1
4. (op_1 obj_21 obj_17)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_16)
   deleted: (pred_4 obj_16 obj_17) (pred_5)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_1 obj_17 obj_19)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_19)
   goals met: 0 of 1
7. (op_5 obj_19 obj_07 obj_16 obj_18)
   deleted: (pred_2 obj_07)
   added: (pred_1 obj_07)
   goals met: 0 of 1
8. (op_1 obj_19 obj_07)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_07)
   goals met: 0 of 1
9. (op_4 obj_07 obj_16)
   deleted: (pred_6 obj_16)
   added: (pred_5) (pred_4 obj_16 obj_07)
   goals met: 1 of 1
